# taps

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/services"

# brews
brew "mackup"
brew "mas"
brew "git"
brew "node@18", link: true

# casks

# cask "dingtalk"
# cask "todesk"
# cask "firefox"
# cask "youdaonote"
# cask "parallels"
# cask "mos"
# cask "clashx"
cask "aldente"
cask "betterdisplay"
cask "google-chrome"
cask "sunloginclient"
cask "parsec"
cask "wechat"
cask "qq"
cask "visual-studio-code"
cask "tencent-lemon"
cask "keka"
cask "iina"
cask "onedrive"
cask "neteasemusic", args: { no_quarantine: true }
cask "utools"
cask "adrive"
cask "bilibili"
cask "microsoft-remote-desktop"
cask "tailscale"

# mas

# mas "Tailscale", id: 1475387142
mas "Qmenu", id: 1567442612
mas "贝锐蒲公英", id: 1305707014
mas "抖音", id: 1640407382