# taps

tap "homebrew/bundle", "https://gitee.com/Homebrew2/homebrew-bundle.git"
tap "homebrew/cask", "https://gitee.com/Homebrew2/homebrew-cask.git"
tap "homebrew/services", "https://gitee.com/Homebrew2/homebrew-services.git"

# brews

brew "git"
brew "node@18", link: true

# casks

# cask "todesk"
# cask "firefox"
# cask "dingtalk"
# cask "youdaonote"
# cask "parallels"
# cask "mos"
cask "aldente"
cask "betterdisplay"
cask "google-chrome"
cask "sunloginclient"
cask "parsec"
cask "wechat"
cask "qq"
cask "visual-studio-code"
cask "tencent-lemon"
cask "keka"
cask "iina"
cask "onedrive"
cask "neteasemusic"
cask "utools"
cask "adrive"
cask "bilibili"
cask "microsoft-remote-desktop"
cask "clashx" do
  version "1.96.2"
  sha256 "26dc384905bb55b10324c8ba690d8ca52d6a99bb3b491b9bb96cfa86ed0efa86"
  url "https://cdn.jsdelivr.net/gh/viarotel/scripts@main/apple/apps/ClashX/1.96.2/ClashX.dmg"
end
cask "tailscale"